Tutorial/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

convertToMeters 0.001;

vertices
(
    (-0.707 0 0.957) //0
    (0.707 0 0.957) //1
    (-0.25 0 0.5) //2
    (0.25 0 0.5) //3
    (-4.19 0 0) //4
    (-1.19 0 0) //5
    (-0.25 0 0) //6
    (0.25 0 0) //7
    (1.19 0 0) //8
    (4.19 0 0) //9
    (-4.19 0 -0.5) //10
    (-1.19 0 -0.5) //11
    (-0.25 0 -0.5) //12
    (0.25 0 -0.5) //13
    (1.19 0 -0.5) //14
    (4.19 0 -0.5) //15
    (-1.19 0 -2.38) //16
    (1.19 0 -2.38) //17
    (-0.25 0 -3.32) //18
    (0.25 0 -3.32) //19
    (-0.25 0 -5.9) //20
    (0.25 0 -5.9) //21
    (-0.707 0.2 0.957) //22
    (0.707 0.2 0.957) //23
    (-0.25 0.2 0.5) //24
    (0.25 0.2 0.5) //25
    (-4.19 0.2 0) //26
    (-1.19 0.2 0) //27
    (-0.25 0.2 0) //28
    (0.25 0.2 0) //29
    (1.19 0.2 0) //30
    (4.19 0.2 0) //31
    (-4.19 0.2 -0.5) //32
    (-1.19 0.2 -0.5) //33
    (-0.25 0.2 -0.5) //34
    (0.25 0.2 -0.5) //35
    (1.19 0.2 -0.5) //36
    (4.19 0.2 -0.5) //37
    (-1.19 0.2 -2.38) //38
    (1.19 0.2 -2.38) //39
    (-0.25 0.2 -3.32) //40
    (0.25 0.2 -3.32) //41
    (-0.25 0.2 -5.9) //42
    (0.25 0.2 -5.9) //43
);

blocks
(
    hex (2 3 25 24 0 1 23 22) (15 1 15) simpleGrading (1 1 1)
    hex (5 6 28 27 0 2 24 22) (15 1 15) simpleGrading (1 1 1)
    hex (7 8 30 29 3 1 23 25 ) (15 1 15) simpleGrading (1 1 1)
    hex (16 18 40 38 11 12 34 33 ) (15 1 15) simpleGrading (1 1 1)
    hex (19 17 39 41 13 14 36 35 ) (15 1 15) simpleGrading (1 1 1)
    hex (10 11 33 32 4 5 27 26) (15 1 15) simpleGrading (1 1 1)
    hex (14 15 37 36 8 9 31 30) (15 1 15) simpleGrading (1 1 1)
    hex (11 12 34 33 5 6 28 27) (15 1 15) simpleGrading (1 1 1)
    hex (13 14 36 35 7 8 30 29) (15 1 15) simpleGrading (1 1 1)
    hex (20 21 43 42 18 19 41 40) (15 1 15) simpleGrading (1 1 1)
    hex (18 19 41 40 12 13 35 34) (15 1 15) simpleGrading (1 1 1)
    hex (12 13 35 34 6 7 29 28) (15 1 15) simpleGrading (1 1 1)
    hex (6 7 29 28 2 3 25 24) (15 1 15) simpleGrading (1 1 1)
);

edges
(
    arc 0 1 (0 0 1.19)
    arc 22 23 (0 0.2 1.19)
    arc 5 0 (-1.021 0 0.612)
    arc 27 22 (-1.021 0.2 0.612)
    arc 1 8 (1.021 0 0.612)
    arc 23 30 (1.021 0.2 0.612)
);

boundary 
(
    boundary
    {
        type wall;
        faces
        (
            (0 5 27 22)
            (1 0 22 23)
            (1 23 30 8)
            (9 8 30 31)
            (36 14 15 37)
            (14 36 39 17)
            (17 39 41 19)
            (19 41 43 21)
            (40 18 20 42)
            (38 16 18 40)
            (33 11 16 38)
            (32 10 11 33)
            (27 5 4 26)
        );
    }

    input1 
    {
        type patch;
        faces
        (
            (4 10 32 26) 
        );
    }

    input2 
    {
        type patch;
        faces
        (
            (9 31 37 15) 
        );
    }

    output
    {
        type patch;
        faces
        (
            (42 20 21 43) 
        );
    }

    frontAndBack
    {
        type empty;
        faces
        (
            (0 1 3 2)
            (0 2 6 5)
            (1 8 7 3)
            (4 5 11 10)
            (5 6 12 11)
            (7 8 14 13)
            (8 9 14 15)
            (11 12 18 16)
            (13 14 17 19)
            (12 13 19 18)
            (6 7 13 12)
            (2 3 7 6)
            (18 19 21 20)
            (22 24 25 23)
            (22 27 28 24)
            (23 25 29 30)
            (27 26 32 33)
            (28 27 33 34)
            (30 29 35 36)
            (31 30 36 37)
            (34 33 38 40)
            (36 35 41 39)
            (25 24 28 29)
            (29 28 34 35)
            (35 34 40 41)
            (41 40 42 43)
        );
    }
);