Tutorial/constant/transportProperties
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}

transportModel Newtonian;
nu             [ 0 2 -1 0 0 0 0 ] 1.5e-05;


Gammac       Gammac   [ 0 2 -1 0 0 0 0 ] 0.002;