Tutorial/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{

    input1
    {
        type            fixedValue;
        value           uniform (0.005 0 0);
    }
    input2
    {
        type            fixedValue;
        value           uniform (-0.005 0 0);
    }
    output
    {
        type            zeroGradient;
    }

    boundary
    {
        type            noSlip;
    }
}

// ************************************************************************* //
