Tutorial/0/moment.4
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      moment.4;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    input1
    {
        type            fixedValue;
        value           uniform 0;
    }
    input2
    {
        type            fixedValue;
        value           uniform 0;
    }
    output
    {
        type            zeroGradient;
    }
    boundary
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
