Tutorial/0/y
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      y;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0.0;

boundaryField
{
    input1
    {
        type            fixedValue;
        value           uniform 0;
    }
    input2
    {
        type            fixedValue;
        value           uniform 0;
    }
    output
    {
        type            zeroGradient;
    }
    boundary
    {
        type            zeroGradient;
    }

}